"""
Задача 4.
Напишите функцию в шахматный модуль. Используйте генератор случайных чисел для случайной расстановки ферзей в задаче выше. 
Проверяйте различный случайные варианты и выведите 4 успешных расстановки.
"""

from Chess_module import successful_position

if __name__ == '__main__':
    successful_position(4)                                                                 # функция вывода n успешных расстановок ферзей на доске 8*8

"""
Вывод:
[[8, 3], [1, 1], [6, 2], [4, 6], [7, 5], [5, 8], [3, 4], [2, 7]] iter =  11887085
[[4, 5], [1, 4], [2, 8], [5, 7], [3, 1], [7, 6], [8, 3], [6, 2]] iter =  22888523
[[5, 2], [3, 5], [8, 3], [6, 4], [1, 1], [7, 6], [2, 7], [4, 8]] iter =  67356741
[[8, 3], [7, 6], [3, 7], [6, 8], [2, 2], [1, 4], [5, 1], [4, 5]] iter =  96536479
"""